0Bu/daikin-altherma-esp32/main/config.cpp
bool config_save_link(int rx_pin, int tx_pin, Protocol proto) {
    // NVS first, off-lock (flash writes are slow — readers shouldn't queue behind them), and only
    // the three link keys: the caller's credentials are never carried along.
    bool ok = true;
    ok &= put_i32("rx_pin", rx_pin);
    ok &= put_i32("tx_pin", tx_pin);
    ok &= put_str("proto", std::string(1, static_cast<char>(proto)));
    // Patch RAM even when the cache write failed, unlike /set_hp's require_link config_save call:
    // this link is PROVEN — the bus just answered on it — and the poll engine reads the pins from
    // here every cycle. Refusing the patch would leave it hammering pins known not to work. A
    // failed write only costs the cache (detection re-runs next boot); `false` tells the caller.
    {
        Lock lk(g_mtx);
        apply_link(g_cfg, rx_pin, tx_pin, proto);
    }
    return ok;
}

// RAM-only by design: the model is re-detected every boot, so there is nothing to persist and no
// failure to report. Allocation happens at the call site, not under the lock (apply_model swaps).
void config_set_model(std::string profile, uint32_t fp_pages, int fp_kw_tenths, int fp_iu_kw_tenths,
                      std::string fp_eeprom) {
    Lock lk(g_mtx);
    apply_model(g_cfg, std::move(profile), fp_pages, fp_kw_tenths, fp_iu_kw_tenths,
                std::move(fp_eeprom));
}

// Whole-struct RAM publish (no NVS). Sole caller is POST /detect (http_config.cpp), which resets
// profile->"auto" + clears the fingerprint: acceptable as a whole-struct write because it runs on the
// httpd task, which OWNS the credential fields (serialized against the other /set_* handlers), so it
// cannot revert them. The poll task must NOT use this — it uses the field-owned config_set_model.
void config_set_runtime(const Config& c) { publish(c); }

// Kconfig-derived hardware facts (see config.hpp). Kept here — the one file that already owns the
// CONFIG_* → link mapping — so board_pins' octal_spi/reserved inputs have a single source of truth
// rather than a #if block duplicated across http_status.cpp, http_config.cpp and config_load().
bool hw_octal_spi() {
#if defined(CONFIG_ESPTOOLPY_OCT_FLASH) || defined(CONFIG_SPIRAM_MODE_OCTAL)
    return true;
#else
    return false;
#endif
}

} // namespace daik
